{
  "malware": "Software berbahaya yang dirancang untuk merusak, mengganggu, atau mendapatkan akses tidak sah ke sistem komputer.",
  "phishing": "Teknik penipuan online yang menggunakan email atau website palsu untuk mencuri informasi pribadi.",
  "ransomware": "Jenis malware yang mengenkripsi file korban dan meminta tebusan untuk membuka kunci.",
  "firewall": "Sistem keamanan jaringan yang memantau dan mengontrol lalu lintas jaringan berdasarkan aturan keamanan.",
  "vpn": "Virtual Private Network - layanan yang membuat koneksi aman dan terenkripsi melalui internet.",
  "encryption": "Proses mengubah informasi menjadi kode rahasia untuk melindungi data dari akses tidak sah.",
  "decryption": "Proses mengubah data terenkripsi kembali ke bentuk aslinya menggunakan kunci yang tepat.",
  "authentication": "Proses verifikasi identitas pengguna atau sistem sebelum memberikan akses.",
  "authorization": "Proses menentukan hak akses pengguna terhadap sumber daya sistem.",
  "vulnerability": "Kelemahan dalam sistem yang dapat dieksploitasi untuk mendapatkan akses tidak sah.",
  "exploit": "Kode atau teknik yang memanfaatkan kerentanan keamanan dalam sistem.",
  "zero-day": "Kerentanan keamanan yang belum diketahui oleh vendor dan belum ada patch tersedia.",
  "social engineering": "Teknik manipulasi psikologis untuk mendapatkan informasi rahasia atau akses tidak sah.",
  "ddos": "Distributed Denial of Service - serangan yang membanjiri server dengan lalu lintas palsu.",
  "man-in-the-middle": "Serangan dimana penyerang menyadap komunikasi antara dua pihak.",
  "sql injection": "Teknik serangan yang menyisipkan kode SQL berbahaya ke dalam input aplikasi.",
  "xss": "Cross-Site Scripting - serangan yang menyisipkan script berbahaya ke website.",
  "backdoor": "Metode rahasia untuk mendapatkan akses tidak sah ke sistem komputer.",
  "trojan": "Malware yang menyamar sebagai software yang sah untuk menipu pengguna.",
  "spyware": "Software yang diam-diam mengumpulkan informasi tentang pengguna tanpa sepengetahuan mereka.",
  "adware": "Software yang menampilkan iklan yang tidak diinginkan kepada pengguna.",
  "rootkit": "Kumpulan software yang memberikan akses tingkat administrator ke sistem.",
  "botnet": "Jaringan komputer yang terinfeksi yang dikendalikan oleh penyerang untuk serangan.",
  "keylogger": "Software atau hardware yang mencatat setiap ketukan keyboard pengguna.",
  "whitelist": "Daftar item yang diizinkan, semua item lain diblokir secara default.",
  "blacklist": "Daftar item yang diblokir, semua item lain diizinkan secara default.",
  "sandbox": "Lingkungan terisolasi untuk menjalankan kode yang mencurigakan dengan aman.",
  "penetration testing": "Proses pengujian keamanan sistem dengan mencoba mengeksploitasi kerentanan.",
  "incident response": "Proses sistematis untuk menangani dan memulihkan dari insiden keamanan.",
  "forensics": "Proses pengumpulan dan analisis bukti digital untuk investigasi keamanan."
}
